package com.furianrt.serenity

import android.app.Application
import dagger.hilt.android.HiltAndroidApp

@HiltAndroidApp
internal class SerenityApp : Application()

/*
* TODO Главный экран
* 2.Множественный выбор записей для проставления тэгов(и еще для чего-нибудь)
* 3.Открытие других экранов через SharedElement
* 4.Сделать закрепление заметки
* */

/*
* TODO Экран заметки
*
* 1.Восстанавливать предыдущий фокус
* 2.
* */

/*
* TODO Общее
*
* 3.Не забыть решить вопрос с часовым поясом
* 4.Проверить RTL
* 5.Сделать блюр
* 6.Отрефакторить навигацию
* 7.Сделать шаблоны
* 8.Сделать блюр на пермишен диалоге
* 9.Пофиксить выделение текста при потере фокуса
* 10.Убрать пробелы при вставке картинки
* 11.Уменьшить отступы у галки в медиа селекторе
* 12.Сделать быстрый скролл вверх на основе общего серолла а не количества заметок
* 13.Сделать дефолтные настройки шрифта на основе тех что юзер выбрал при создании последней заметки
* */

/*
* TODO Видео
*
* 2.Добавить полноэкранный режим
* */