package com.furianrt.serenity

import android.app.Application
import dagger.hilt.android.HiltAndroidApp

@HiltAndroidApp
internal class SerenityApp : Application()

/*
* TODO Главный экран
* 2.Множественный выбор записей для проставления тэгов(и еще для чего-нибудь)
* 3.Открытие других экранов через SharedElement
* 4.Сделать закрепление заметки
* */

/*
* TODO Экран заметки
*
* 1.Восстанавливать предыдущий фокус
* 2.
* */

/*
* TODO Общее
*
* 4.Проверить RTL
* 7.Сделать шаблоны
* 8.Сделать блюр на пермишен диалоге
* 9.Пофиксить выделение текста при потере фокуса
* 12.Сделать быстрый скролл вверх на основе общего серолла а не количества заметок
* */

/*
* TODO Видео
*
* 2.Добавить полноэкранный режим
* */